# -*- coding: utf-8 -*-
# kw_naming.py
"""
영웅문Global의 화면번호
image 파일 이름
영웅문Global의 정보창 좌표
"""

# 변수 초기값 설정
CONFIDENCE = 0.8
WAIT_TIME = 1

# 계좌번호
# 5931-3334 :   1   (해외기본계좌)
# 5931-6458 :   2   (적립식VR)
# 6000-6785 :   3   (해외예비 1)
# 6000-6798 :   4   (아바타SOXL)
# 6057-9823 :   5   (무매)
# 6057-9850 :   6   (해외스윙)
# 6090-7335 :   7   (국내기본계좌)
# 6090-7342 :   8   (국내스윙)


# 화면번호
화면번호_실시간잔고 = "2150"
화면번호_실시간미체결 = "2152"
화면번호_주문체결확인 = "2151"
화면번호_미니주문 = "2102"


# 이미지 파일 이름
img_탭_실시간잔고 = "./image/2150.png"
img_탭_실시간잔고계좌번호 = "./image/2150_account.png"
img_탭_인증서이경호 = './image/kw_certi_lkh.png'
img_탭_영웅문로고 = './image/kw_program.png'

img_버튼_실시간잔고조회 = "./image/2150_check.png"
img_버튼_공동인증서로그인 = './image/kw_certi_button.png'

img_박스_서브윈도우닫기 = "./image/kw_closebox.png"
img_박스_접속상태화면닫기 = "./image/kw_closebox_start.png"

img_인증서비번_이경호 = 'djajsldkqjwl2632@@'


# 영웅문Global의 정보창 좌표

좌표_메인_화면번호입력란 = (60, 100)  # 키움증권 화면번호 적는 위치 좌표(최대화 상태)

좌표_미니주문_매수탭 = (480, 1005)
좌표_미니주문_매도탭 = (580, 1005)
좌표_미니주문_정정탭 = (680, 1005)

좌표_미니주문_종목 = (520, 1050)
좌표_미니주문_매수종류 = (520, 1080)
좌표_미니주문_매도종류 = (520, 1080)
좌표_미니주문_정정번호 = (520, 1080)
좌표_미니주문_수량 = (520, 1120)
좌표_미니주문_가격 = (520, 1180)
좌표_미니주문_매수신청 = (490, 1315)
좌표_미니주문_매도신청 = (490, 1315)
